---
kind: method
id: M:Autodesk.Revit.DB.IntegerParameterValue.#ctor
source: html/233a1426-3c74-b988-073b-59b5b0e59b8e.htm
---
# Autodesk.Revit.DB.IntegerParameterValue.#ctor Method

Default constructor

## Syntax (C#)
```csharp
public IntegerParameterValue()
```